#13: Konversi nilai numerik ke dalam sejumlah kategori

Bryan Nicholas - 2273009

Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.1.3
1.26.2

Persiapan Data Frame

In [3]:
n_rows = 10
n_cols = 1
cols = ('usia',)

df = pd.DataFrame(np.random.randint(1, 99, size=(n_rows, n_cols)), 
                  columns=cols)
df

   usia
0    98
1    93
2    11
3    45
4    34
5    45
6    89
7    17
8    58
9     4

Pengelompokkan nilai numerik ke dalam beberapa kategori menggunakan cut()

In [4]:
df['kelompok_usia'] = pd.cut(df['usia'], 
                             bins=[0, 18, 65, 99], 
                             labels=['anak', 'dewasa', 'manula'])
df

   usia kelompok_usia
0    98        manula
1    93        manula
2    11          anak
3    45        dewasa
4    34        dewasa
5    45        dewasa
6    89        manula
7    17          anak
8    58        dewasa
9     4          anak